
module.exports.config = {
name: 'autosent',
version: '10.02',
hasPermssion: 0,
credits: 'PREM BABU',
description: 'THIS BOT WAS MADE BY MR PREM BABU',
commandCategory: 'AUTO SEND TIMER',
usages: 'AUTOSENT',
cooldowns: 3
};
const nam = [{
timer: '01:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:30 P𝐌 ⏳  हकीकत कहो तो उन्हें ख्वाब लगता है 💕 शिकवा करो तो उन्हें मज़ाक लगता है 💕 कितनी शिद्दत से हम उन्हें याद करतें हैं 💕 एक वो हैं जिन्हें ये सबकुछ मजाक लगता है…!! 💝💝💝 𝐁𝐚𝐛𝐲 𝐊𝐡𝐚𝐧𝐚 𝐊𝐡𝐚𝐲𝐚 𝐀𝐚𝐩 𝐍𝐞? 😒 ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '1:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:30 𝗔𝐌 ⏳ ऐ चांद- तारों 💕 जरा इनको एक लात मारो 💕 बिस्तर से इनको नीचे उतारो 💕 करो इनके साथ फाइट 💕 क्योंकि ये सो गए है बिना बोले गुड नाईट 💝💝💝 𝐆𝐨𝐨𝐝 𝐍𝐢𝐠𝐡𝐭 𝐓𝐨𝐡 𝐁𝐨𝐥 𝐃𝐞𝐭𝐞 𝐘𝐚𝐚𝐫 🥺 ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '2:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:30 A𝐌 ⏳  पागल सा बच्चा हूँ 💕 मगर दिल का सच्चा हूँ 💕 थोड़ा सा आवारा हूँ💕 मगर तेरा ही तो दीवाना हूँ...!!💝💝💝 𝐒𝗼 𝐉𝗮𝗼 𝐘𝗮𝗿 𝐊𝗼𝗶 𝐍𝗵𝗶 𝐇 😇 𝐓𝘂𝗺𝗵𝗮𝗿𝗮 𝐌𝗲𝗿𝗲 𝐒𝗶𝘃𝗮😘  ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '3:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:30 A𝐌 ⏳ ज़िंदगी में कामयाबी की मंज़िल के लिए 💕 ख्वाब ज़रूरी है 💕 और ख्वाब देखने के लिए नींद 💕 तो अपनी मंज़िल की पहली सीढ़ी चढ़ो और सो जाओ...!! गुड नाइट 💝💝💝 𝗧𝘂𝗺 𝗔𝗯𝗵𝗶 𝗧𝗮𝗸 𝗦𝗼𝘆𝗲 𝗡𝗵𝗶 😳 ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '4:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:30 A𝐌 ⏳   रात की तन्हाई में अकेले थे हम 💕 दर्द की महफ़िलो में रो रहे थे हम 💕 आप हमारे भले ही कुछ नहीं लगते 💕 फिर भी आप को याद किये बिना सोते नहीं हम...!!💝💝💝 𝐓𝐮𝐦𝐬𝐞 𝐊𝐨𝐢 𝐧𝐡𝐢 𝐩𝐚𝐭𝐞𝐠𝐚 𝐲𝐚𝐚𝐫 𝐀𝐜𝐜𝐡𝐚 𝐡𝐨𝐠𝐚 𝐬𝐨 𝐣𝐚𝐨 😒  ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '5:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:30 A𝐌 ⏳   रात ने चादर समेट ली है 💕 सूरज ने किरणे बिखेर दी है  💕 चलो उठो और धन्यवाद करो अपने भगवान को 💕 जिसने हमे ये प्यारी सी सुबह दी है...!!💝💝💝 𝐆𝐨𝐨𝐝 𝐌𝐨𝐫𝐧𝐢𝐧𝐠 𝐑𝐚𝐝𝐡𝐞 𝐑𝐚𝐝𝐡𝐞 🥰 ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '6:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:30 𝗔𝐌 ⏳ सुबह-सुबह आपकी यादों का साथ हो 💕 मीठी-मीठी परिंदों की आवाज हो 💕 आपके चेहरे पर हमेशा मुस्कुराहट हो 💕 और हमारी जिन्दगी में सिर्फ आपका साथ हो...!!💝💝💝 𝐑𝐚𝐝𝐡𝐞 𝐑𝐚𝐝𝐡𝐞😇  ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '7:00:00 AM',
message: ['──── •💜• ────                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:30 A𝐌 ⏳  प्यारी सी मीठी सी निंदिया के बाद 💕 रात के हसीन सपनों के बाद 💕 सुबह के कुछ नए सपनों के साथ 💕 आप हँसते रहें अपनों के साथ।💝💝💝 𝐆𝐨𝐨𝐝 𝐌𝐨𝐫𝐧𝐢𝐧𝐠 𝐄𝐯𝐞𝐫𝐲𝐎𝐧𝐞 🤗  ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '8:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:30 𝗔𝐌 ⏳  न मंदिर 💕 न भगवान 💕 न पूजा 💕 न स्नान 💕 सुबह उठते ही पहला काम एक SMS आपके नाम...!!💝💝💝 𝐏𝐮𝐫𝐢 𝐑𝐚𝐚𝐭 𝐍𝐡𝐢 𝐒𝐨𝐲𝐞 𝐇𝐨𝐠𝐞 ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '9:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:30 A𝐌 ⏳ जितनी खूबसूरत ये गुलाबी सुबह है 💕 उतना ही खूबसूरत आपका हर पल हो 💕 जितनी भी खुशियाँ आज आपके पास हैं 💕 उससे भी जादा आने वाले कल में हो....!!💝💝💝 𝐔𝐭𝐡 𝐆𝐲𝐞 𝐏𝐫𝐞𝐦 𝐣𝐢 𝐀𝐚𝐩? 🥰 ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '10:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:30 A𝐌 ⏳  अर्ज किया है.... 💕 चाय के कप से उठते धुए में तेरी सकल नजर आती है 💕 ऐसे खो जाते है तेरे खयालों में कि 💕अकसर मेरी चाय ठंडी हो जाती है…...!!!💝💝💝 𝐍𝐚𝐬𝐭𝐚 𝐊𝐚𝐫𝐧𝐞 𝐊𝐚 𝐓𝐢𝐦𝐞 𝐇𝐨 𝐆𝐲𝐚🥪 𝐁𝐫𝐞𝐚𝐤𝐟𝐚𝐬𝐭 𝐊𝐚𝐫𝐥𝐨 𝐁𝐚𝐛𝐲🙈     ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '11:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:30 A𝐌 ⏳ बसा ले नज़र में सूरत तुम्हारी 💕 दिन रात इसी पर हम मरते रहें 💕 खुदा करे जब तक चले ये साँसे हमारी 💕 हम बस तुमसे ही प्यार करते रहें ॥💝💝💝 𝐓𝐮𝐦 𝐀𝐛𝐡𝐢 𝐓𝐚𝐤 𝐉𝐢𝐧𝐝𝐚 𝐇𝐨?🙀    ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '12:00:00 AM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:30 A𝐌 ⏳ कोई चाँद सितारा हैं 💕 कोई फूल से भी प्यारा हैं 💕 जो हर पल याद आए 💕वो पल पल सिर्फ तुम्हारा हैं....!!💝💝💝 𝐌𝐞𝐫𝐚 𝐁𝐨𝐬𝐬 𝐏𝐫𝐞𝐦 𝐛𝐚𝐛𝐮 𝐀𝐛𝐡𝐢 𝐅𝐫𝐞𝐞 𝐇𝐚𝐢😻 ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '1:00:00 PM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:30 𝐏𝐌 ⏳ एक सपने की तरह सजा कर रखु 💕 अपने इस दिल में हमेशा छुपा कर रखु 💕 मेरी तक़दीर मेरे साथ नहीं वर्ना 💕 ज़िंदगी भर के लिए उसे अपना बना कर रखु....!!💝💝💝 𝐔𝐟𝐟 𝐊𝐢𝐭𝐧𝐢 𝐆𝐚𝐫𝐦𝐢 𝐇 𝐁𝐚𝐡𝐚𝐫🥵        ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '2:00:00 PM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:30 𝐏𝐌 ⏳ आज एक दोपहर की ग़ज़ल तेरे नाम हो जाये 💕 मेरा सेवरा बस तेरे नाम हो जाये 💕 लेता रहूं तेरा ही नाम और सुबह से शाम हो जाये।💝💝💝 𝐆𝐨𝐨𝐝 𝐀𝐟𝐭𝐞𝐫𝐍𝐨𝐨𝐧 𝐄𝐯𝐞𝐫𝐲𝐨𝐧𝐞🌞 ⁣༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '3:00:00 PM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:30 𝐏𝐌 ⏳  सूरज चाचू ऊपर चढ़ पड़े हैं 💕 और तपती गर्मी से हमें तड़पाते है 💕 दोपहर का खाना अब पेट को जाना है 💕 फिर तकया पकड़ कर चैन की नींद सो जाना है।💝💝💝 𝐆𝐨𝐨𝐝 𝐀𝐟𝐭𝐞𝐫𝐍𝐨𝐨𝐧 𝐄𝐯𝐞𝐫𝐲𝐨𝐧𝐞🌞 𝐉𝐚𝐥𝐝𝐢 𝐒𝐞 𝐍𝐚𝐡𝐚 𝐋𝐨   ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒ ']
},
{
timer: '4:00:00 PM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:30 𝐏𝐌 ⏳  जब तन्हाई में आपकी याद आती है 💕 होंठो पे एक ही फरियाद आती है 💕 खुदा आपको हर खुशी दे 💕 क्यूंकी आज भी हमारी हर खुशी आपके बाद आती है।💝💝💝 𝐇𝐚𝐲𝐞 𝐆𝐚𝐫𝐦𝐢 🥵 ⁣༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒ ']
},
{
timer: '5:00:00 PM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:30 𝐏𝐌 ⏳   अपने हाथों से तेरी मांग सजाऊं 💕 तुझे मैं मेरी किस्मत बनाऊं 💕 हवा भी बीच से गुज़र ना सके 💕 हो इजाजत तो इतने करीब आऊं ...!!💝💝💝 𝐋𝐨𝐯𝐞 𝐘𝐨𝐮 𝐄𝐯𝐞𝐫𝐲𝐨𝐧𝐞 😌 ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒']
},
{
timer: '6:00:00 PM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:30 𝐏𝐌 ⏳ बिना शृंगार,भोली सी सूरत 💕 हर बात पर सच्ची लगती हो 💕 हा तुम हो बिलकुल मेरी चाय के जैसी 💕 मुझे सांवली ही अच्छी लगती हो… ❤️❤️❤️𝐓𝐞𝐞 𝐓𝐢𝐦𝐞 ☕ 𝐌𝐚𝐢 𝐁𝐚𝐧𝐚𝐤𝐞 𝐃𝐮 𝐁𝐚𝐛𝐲?𝐓𝐨𝐡 𝐋𝐢𝐤𝐤𝐡𝐨 ☞ 𝐓𝐞𝐚 ☜ ༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒ ']
},
{
timer: '7:00:00 PM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:30 𝐏𝐌 ⏳     आँधी में भी दीये जला करते हैं 💕 कांटो में ही गुलाब खिला करते हैं 💕 खुश नसीब होती है वो शाम जिसमें आप जैसे लोग मिला करते हैं।🥀😌🌴 𝐆𝐨𝐨𝐝 𝐄𝐯𝐞𝐧𝐢𝐧𝐠 𝐄𝐯𝐞𝐫𝐲𝐨𝐧𝐞,😍😘 ⁣༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒ ']
},
{
timer: '8:00:00 PM',
message: ['──── •💜• ────  𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:30 𝐏𝐌 ⏳बिंदास मुस्कुराओ क्या गम है 💕 जिन्दगी में टेंशन किसको कम हैं 💕 अच्छा या बुरा तो केवल भ्रम हैं 💕 जिन्दगी का नाम 💕 कभी ख़ुशी कभी गम हैं।💝💝💝 𝐒𝐚𝐛 𝐇𝐚𝐢 𝐘𝐚𝐡𝐚, 𝐏𝐚𝐭𝐚 𝐍𝐡𝐢 𝐌𝐞𝐫𝐚 𝐁𝐨𝐬𝐬 𝐏𝐫𝐞𝐦 𝐇𝐚𝐢 𝐊𝐚𝐡𝐚 😞   𝐈 𝐌𝐢𝐬𝐬 𝐘𝐨𝐮 𝐏𝐫𝐞𝐦 𝐁𝐚𝐛𝐮 🥺 ⁣⁣༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒ ']
},
{
timer: '9:00:00 PM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:30 𝐏𝐌 ⏳ दिल से दिल की बस यही दुआ है 💕 आज फिर से हमको कुछ हुआ है 💕 शाम ढलते ही आती है याद आपकी 💕 लगता है प्यार आपसे ही हुआ है।💝💝💝 𝐈 𝐋𝐨𝐯𝐞 𝐘𝐨𝐮 𝐏𝐫𝐞𝐦 𝐁𝐚𝐛𝐮 😘 ⁣༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒ ']
},
{
timer: '10:00:00 PM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:30 𝐏𝐌 ⏳ चाँद सा चेहरा देखने की इज़ाज़त दे दो 💕 मुझे ये शाम सजाने की इज़ाज़त दे दो 💕 मुझे कैद कर लो अपने इश्क़ में या फिर मुझे इश्क़ करने की इज़ाज़त दे दो।💝💝💝 𝐈 𝐥𝐨𝐯𝐞 𝐘𝐨𝐮 𝐄𝐯𝐞𝐫𝐲𝐨𝐧𝐞🥰 ⁣༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒ ']
},
{
timer: '11:00:00 PM',
message: ['──── •💜• ──── 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:30 P𝐌 ⏳ रात को जब चाँद सितारे चमकते हैं 💕 हम हरदम आपकी याद में तड़पते हैं 💕 आप तो चले जाते हो छोड़कर हमें 💕 हम रात भर आपसे मिलने को तरसते हैं।💝💝💝 𝐃𝐢𝐧𝐧𝐞𝐫 𝐊𝐚𝐫𝐥𝐨 𝐉𝐚𝐥𝐝𝐢 𝐒𝐞 𝐒𝐚𝐛 𝐋𝐨𝐠 𝐎𝐫 𝐉𝐚𝐥𝐝𝐢 𝐒𝐨 𝐉𝐚𝐨 ⁣༒𓆩𝙿𝚁𝙴𝙼 𝙱𝙰𝙱𝚄𓆪༒ ']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
